# Homebrew
# https://docs.brew.sh/Brew-Bundle-and-Brewfile

# Formulae
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "mailpit", restart_service: :changed
brew "mas"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "symfony-cli"
brew "terminal-notifier"
brew "xcode-build-server"
brew "xdg-ninja"
brew "yq"

# Casks
cask "1password-cli"
cask "chatgpt"
cask "codex"
cask "codex-app"
cask "dbngin"
cask "dockdoor"
cask "dropbox"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "keyclu"
cask "notunes"
cask "orbstack"
cask "pearcleaner"
cask "postman"
cask "raycast"
cask "sequel-ace"
cask "slack"
cask "stats"
cask "visual-studio-code"

# Casks - Subscription
cask "1password"
cask "cleanshot"
cask "moom"
cask "parallels"
cask "vpn-tracker-365"

# Casks - Paid
cask "default-folder-x"
cask "launchos"
cask "mission-control-plus"

# Mac App Store
mas "Amphetamine", id: 937984704
mas "Developer", id: 640199958
mas "Xcode", id: 497799835

# Mac App Store - Paid
mas "Dato", id: 1470584107
mas "Things", id: 904280696
mas "UpNote", id: 1398373917
