# Homebrew
# https://github.com/Homebrew/brew
tap '1password/tap'
tap 'beeftornado/rmtree'
tap 'homebrew/autoupdate'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

brew 'asdf'
brew 'awscli'
brew 'coreutils'
brew 'curl'
brew 'fzf'
brew 'ghq'
brew 'git'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'mysql'
brew 'neovim'
brew 'openssl'
brew 'terminal-notifier'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'wget'

# PHP
# https://github.com/asdf-community/asdf-php
brew 'autoconf'
brew 'automake'
brew 'bison'
brew 'freetype'
brew 'gd'
brew 'gettext'
brew 'icu4c'
brew 'krb5'
brew 'libedit'
brew 'libiconv'
brew 'libjpeg'
brew 'libpng'
brew 'libxml2'
brew 'libzip'
brew 'openssl@1.1'
brew 'pkg-config'
brew 're2c' 
brew 'zlib'

# Homebrew Cask
# https://github.com/Homebrew/homebrew-cask
cask '1password'
cask 'appcleaner'
cask 'bartender'
cask 'bettertouchtool'
cask 'calibre'
cask 'clipy'
cask 'docker'
cask 'dropbox'
cask 'fig'
cask 'flux'
cask 'font-cica'
cask 'google-chrome'
cask 'hyperdock'
cask 'iterm2'
cask 'istat-menus'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'kindle'
cask 'microsoft-remote-desktop'
cask 'moom'
cask 'sequel-ace'
cask 'skitch'
cask 'slack'
cask 'visual-studio-code'
cask 'vlc'
cask 'vpn-tracker-365'

# mas-cli
# https://github.com/mas-cli/mas
mas 'Amphetamine', id: 937984704
mas 'Paste Plain Text', id: 1407015686
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
