# Homebrew
# https://github.com/Homebrew/brew
tap 'beeftornado/rmtree'
tap 'domt4/autoupdate'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'sscotth/sip'

brew 'anyenv'
brew 'awscli'
brew 'coreutils'
brew 'curl'
brew 'fzf'
brew 'ghq'
brew 'git'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'mackup'
brew 'openssl'
brew 'neovim'
brew 'ranger'
brew 'pipenv'
brew 'python'
brew 'terminal-notifier'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'zsh'

# Homebrew Cask
# https://github.com/Homebrew/homebrew-cask
cask 'alfred'
cask 'appcleaner'
cask 'audirvana'
cask 'bartender'
cask 'bettertouchtool'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'font-cica'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'hackintool'
cask 'intel-power-gadget'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'keyboardcleantool'
cask 'kindle'
cask 'microsoft-office'
cask 'monitorcontrol'
cask 'mysqlworkbench'
cask 'parallels'
cask 'skype'
cask 'sony-ps4-remote-play'
cask 'sublime-text'
cask 'tableplus'
cask 'totalfinder'
cask 'vlc'

# mas-cli
# https://github.com/mas-cli/mas
mas '1Password 7', id: 1333542190
mas 'Amphetamine', id: 937984704
mas 'DaisyDisk', id: 411643860
mas 'HyperDock', id: 449830122
mas 'LINE', id: 539883307
mas 'Moom', id: 419330170
mas 'Parallels Client', id: 600925318
mas 'PopClip', id: 445189367
mas 'Skitch', id: 425955336
mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Xliffie', id: 961651406
mas 'Yoink', id: 457622435
mas 'そら案内', id: 599799247
