tap 'beeftornado/rmtree'
tap 'sanemat/font'
tap 'sscotth/sip'

brew 'ansible'
brew 'apache2', restart_service: :changed
brew 'awscli'
brew 'brew-php-switcher'
brew 'certbot'
brew 'composer'
brew 'coreutils'
brew 'dnsmasq'
brew 'elasticsearch'
brew 'git'
brew 'git-flow'
brew 'hub'
brew 'logstash'
brew 'mysql@5.7', restart_service: :changed, link: true, conflicts_with: ["mysql"]
brew 'mackup'
brew 'neovim'
brew 'nvm'
brew 'openssl'
brew 'php'
brew 'php@7.1', conflicts_with: ["php"]
brew 'php@7.0', conflicts_with: ["php"]
brew 'phpunit'
brew 'pyenv'
brew 'python'
brew 'ricty', args: ['with-powerline']
brew 'rbenv'
brew 'rbenv-communal-gems'
brew 'ruby-build'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'

cask 'alfred'
cask 'appcleaner'
cask 'audirvana-plus'
cask 'bartender'
cask 'bettertouchtool'
cask 'chatwork'
cask 'clipy'
cask 'docker'
cask 'dropbox'
cask 'duet'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'kindle'
cask 'maczip4win'
cask 'microsoft-office'
cask 'mysqlworkbench'
cask 'resolutionator'
cask 'parallels'
cask 'postman'
cask 'sequel-pro'
cask 'sketch'
cask 'skype'
cask 'sourcetree'
cask 'sublime-text'
cask 'totalfinder'
cask 'vlc'

mas '1Password', id: 443987910
mas 'Amphetamine', id: 937984704
mas 'Fantastical 2', id: 975937182
mas 'Get Plain Text', id: 508368068
mas 'LINE', id: 539883307
mas 'Moom', id: 419330170
mas 'OmniFocus 3', id: 1346203938
mas 'Parallels Client', id: 600925318
mas 'PopClip', id: 445189367
mas 'SoraAnnai', id: 599799247
mas 'Spark', id: 1176895641
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Transmit', id: 403388562
mas 'VirusScannerPlus', id: 595374522
mas 'Xcode', id: 497799835
mas 'Yoink', id: 457622435
