# Homebrew
# https://brew.sh/
tap 'beeftornado/rmtree'

brew 'chezmoi'
brew 'curl'
brew 'fzf'
brew 'gh'
brew 'ghq'
brew 'git'
brew 'gpg'
brew 'jq'
brew 'mise'
brew 'neovim'
brew 'tmux'
brew 'trash'
brew 'wget'
brew 'xdg-ninja', args: ['HEAD']
brew 'zsh'

# A curated list of command-line utilities written in Rust
# https://gist.github.com/sts10/daadbc2f403bdffad1b6d33aff016c0a
brew 'bat'
brew 'fd'
brew 'tealdeer'
brew 'ripgrep'
brew 'xh'

# brew tap shivammathur/php
# https://github.com/shivammathur/homebrew-php
brew 'shivammathur/php/php@7.3'
brew 'shivammathur/php/php@7.4'
brew 'shivammathur/php/php@8.3'

cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'chatgpt'
cask 'dropbox'
cask 'font-meslo-for-powerlevel10k'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'notunes'
cask 'obsidian'
cask 'orbstack'
cask 'karabiner-elements'
cask 'monitorcontrol'
cask 'moom'
cask 'postman'
cask 'readdle-spark'
cask 'sequel-ace'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vpn-tracker-365'

# mas-cli
# https://github.com/mas-cli/mas
mas 'Amphetamine', id: 937984704
mas 'Pure Paste', id: 1611378436
mas 'Windows App', id: 1295203466
