# Homebrew
# https://docs.brew.sh/Brew-Bundle-and-Brewfile

# taps
tap 'shivammathur/php'

# formulae
brew 'bat'
brew 'chezmoi'
brew 'composer'
brew 'eza'
brew 'gh'
brew 'git'
brew 'less'
brew 'mailpit', restart_service: :changed
brew 'mise'
brew 'neovim'
brew 'php'
brew 'symfony-cli'
brew 'xdg-ninja', args: ['HEAD']
brew 'zsh'

# casks
cask '1password'
cask 'alt-tab'
cask 'chatgpt'
cask 'claude-code'
cask 'dbngin'
cask 'dockdoor'
cask 'dropbox'
cask 'font-meslo-for-powerlevel10k'
cask 'google-chrome'
cask 'ice'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'jordanbaird-ice'
cask 'karabiner-elements'
cask 'keka'
cask 'maccy'
cask 'mission-control-plus'
cask 'moom'
cask 'notunes'
cask 'orbstack'
cask 'pearcleaner'
cask 'postman'
cask 'readdle-spark'
cask 'sequel-ace'
cask 'slack'
cask 'visual-studio-code'
cask 'vpn-tracker-365'

# mas
# https://github.com/mas-cli/mas
mas 'Amphetamine', id: 937984704
mas 'Dato', id: 1470584107
mas 'Things', id: 904280696
mas 'UpNote', id: 1398373917
mas 'Xcode', id: 497799835
